Задание 2.7: Написать программу порождающую дочерний процесс и использующую однонаправленный обмен данными. Процесс-потомок генерирует случайные числа и отправляет родителю. Родитель выводит числа на экран и в файл. Количество чисел задаётся в параметрах запуска приложения.

Для выполнения задания использовались функции:
1. pipe()	Предназначенная для создания неменнованного канала
2. fork()	Предназначенная для порождения дочернего процесса
3. fopen()	Предназначенная для открытия файла
4. read()	Предназначенная для чтения из канала
5. write()	Предназначенная для записи в канал
6. fprintf()	Предназначенная для записи в файл
